Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyElementType.MergedMarkPropertyElementTypes Class
 The MergedMarkPropertyElementTypes class represents the available property element types for merged marks.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PropertyElement.PropertyElementType.MergedMarkPropertyElementTypes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class MergedMarkPropertyElementTypes
<SerializableAttribute>
Public NotInheritable Class MergedMarkPropertyElementTypes
The PropertyElement.PropertyElementType.MergedMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
BlockPrefix
Returns the block prefix property element type.
DistancesBetweenGroups
Returns the distances between groups property element type.
SingleMarkContent
Returns the single mark content property element type.
SymbolSeparatingBlocksInMarks
Returns the symbol separating blocks in marks property element type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace